const newsJSON = getNewsJSON();

class News {
  render(news) {
    const {id, title, author, date, time, article} = news;
  }
}

if ( location.pathname.indexOf('/index') !== -1 ) {
  const news = document.querySelectorAll('.news');
  const state = {};

  news.forEach( item => {
    const checkElement = item.querySelector('.news__check');
    const newsID = String(item.querySelector('.news__link>a').getAttribute('data-id'));

    if(localStorage.getItem('state')) {
      const isState = JSON.parse(localStorage.getItem('state'))[newsID] in JSON.parse(localStorage.getItem('state'));
      
      if (isState) {
        checkElement.innerHTML = 'Прочитано';
      }
    }

    item.onclick = (e) => {
      if (e.target.tagName !== 'A') return false;
      localStorage.setItem('news-id', newsID);

      // Если нету в localStorage, тогда записать.
      if ( !(state[newsID] in state) ) {
        state[newsID] = newsID;
        localStorage.setItem('state', JSON.stringify(state));
      }
    };
  })
}


if ( location.pathname.indexOf('/news') !== -1 ) { 

}



/* 
  Я рассматривал несколько вариантов для импорта новостей:
    1) Использовать сборщик WEBPACK, чтобы импортировать сам json, 
    но не стал нагружать тестовое задание модулями;
    2) Переименовать файл json в js и импортировать возможностями ES6, 
    не сработало, ибо по умолчанию браузер разрешает импорты только по HTTP.

  Исходя из этого я пришел к такому варианту.
*/
function getNewsJSON() {
  return {
    "1": {
      "id": "1",
      "title": "Анализ направлений.",
      "author": "Журавлева Злата Лукинична",
      "date": "07.04.2020",
      "time": "21:23:38",
      "article": "Таким образом постоянный количественный рост и сфера нашей активности позволяет оценить значение существенных финансовых и административных условий. Таким образом рамки и место обучения кадров играет важную роль в формировании систем массового участия. Задача организации, в особенности же консультация с широким активом влечет за собой процесс внедрения и модернизации систем массового участия."
    },
    "2": {
      "id": "2",
      "title": "Товарищи!",
      "author": "Васильева Юлия Дмитриевна",
      "date": "12.01.2020",
      "time": "01:26:44",
      "article": "Таким образом постоянный количественный рост и сфера нашей активности позволяет оценить значение существенных финансовых и административных условий. Таким образом рамки и место обучения кадров играет важную роль в формировании систем массового участия. Задача организации, в особенности же консультация с широким активом влечет за собой процесс внедрения и модернизации систем массового участия."
    },
    "3": {
      "id": "3",
      "title": "Товарищи!",
      "author": "Журавлева Злата Лукинична",
      "date": "19.09.2020",
      "time": "22:59:03",
      "article": "Таким образом постоянный количественный рост и сфера нашей активности требуют определения и уточнения модели развития. Разнообразный и богатый опыт дальнейшее развитие различных форм деятельности требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности играет важную роль в формировании новых предложений. Товарищи! сложившаяся структура организации играет важную роль в формировании модели развития."
    },
    "4": {
      "id": "4",
      "title": "Товарищи!",
      "author": "Нестерова Эмилия Васильевна",
      "date": "28.08.2019",
      "time": "09:39:07",
      "article": "Таким образом постоянный количественный рост и сфера нашей активности позволяет оценить значение существенных финансовых и административных условий. Таким образом рамки и место обучения кадров играет важную роль в формировании систем массового участия. Задача организации, в особенности же консультация с широким активом влечет за собой процесс внедрения и модернизации систем массового участия."
    },
    "5": {
      "id": "5",
      "title": "Товарищи!",
      "author": "Смирнов Михаил Матвеевич",
      "date": "21.03.2020",
      "time": "12:28:00",
      "article": "Разнообразный и богатый опыт начало повседневной работы по формированию позиции играет важную роль в формировании дальнейших направлений развития. Таким образом новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Значимость этих проблем настолько очевидна, что рамки и место обучения кадров способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт консультация с широким активом в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. С другой стороны сложившаяся структура организации способствует подготовки и реализации новых предложений."
    },
    "6": {
      "id": "6",
      "title": "Соображения высшего порядка.",
      "author": "Черняев Руслан Егорович",
      "date": "07.10.2020",
      "time": "04:26:14",
      "article": "Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки модели развития. Идейные соображения высшего порядка, а также сложившаяся структура организации представляет собой интересный эксперимент проверки дальнейших направлений развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять важные задания по разработке новых предложений. Товарищи! новая модель организационной деятельности требуют определения и уточнения дальнейших направлений развития."
    },
    "7": {
      "id": "7",
      "title": "Анализ направлений.",
      "author": "Смирнов Михаил Матвеевич",
      "date": "26.02.2020",
      "time": "22:24:27",
      "article": "Не следует, однако забывать, что реализация намеченных плановых заданий требуют определения и уточнения дальнейших направлений развития. Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет выполнять важные задания по разработке существенных финансовых и административных условий. Равным образом новая модель организационной деятельности требуют от нас анализа направлений прогрессивного развития. Повседневная практика показывает, что начало повседневной работы по формированию позиции способствует подготовки и реализации новых предложений."
    },
    "8": {
      "id": "8",
      "title": "Анализ направлений.",
      "author": "Смирнов Михаил Матвеевич",
      "date": "02.03.2020",
      "time": "14:13:28",
      "article": "Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки модели развития. Идейные соображения высшего порядка, а также сложившаяся структура организации представляет собой интересный эксперимент проверки дальнейших направлений развития. С другой стороны постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять важные задания по разработке новых предложений. Товарищи! новая модель организационной деятельности требуют определения и уточнения дальнейших направлений развития."
    },
    "9": {
      "id": "9",
      "title": "Товарищи!",
      "author": "Черняев Руслан Егорович",
      "date": "13.06.2020",
      "time": "21:31:36",
      "article": "Таким образом постоянный количественный рост и сфера нашей активности требуют определения и уточнения модели развития. Разнообразный и богатый опыт дальнейшее развитие различных форм деятельности требуют определения и уточнения систем массового участия. Значимость этих проблем настолько очевидна, что дальнейшее развитие различных форм деятельности играет важную роль в формировании новых предложений. Товарищи! сложившаяся структура организации играет важную роль в формировании модели развития."
    },
    "10": {
      "id": "10",
      "title": "Определения и уточнения модели.",
      "author": "Нестерова Эмилия Васильевна",
      "date": "05.04.2020",
      "time": "16:17:46",
      "article": "Разнообразный и богатый опыт начало повседневной работы по формированию позиции играет важную роль в формировании дальнейших направлений развития. Таким образом новая модель организационной деятельности представляет собой интересный эксперимент проверки форм развития. Значимость этих проблем настолько очевидна, что рамки и место обучения кадров способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Разнообразный и богатый опыт консультация с широким активом в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. С другой стороны сложившаяся структура организации способствует подготовки и реализации новых предложений."
    }
  }
}